//#include <stdio.h>
//
//void main()
//{ //Ex2-3
//	printf("\t hello C!  \n Hello world! \n");
//	printf(" : \" \" \n");
//	printf(": \' \' \n'");
//	printf(": \\ \n");
//}




//{//Ex 2-4
//	printf("%d 더하기 %d는 %d 입니다.\n", 3, 5, 3 + 5);
//	printf("%d 더하기 %i는 %i 입니다.\n", 3, 5, 5 + 5);
//	printf("%d - %d = %d 입니다.\n", 3, 5, 3 - 5);
//	printf("%i - %o = %i 입니다.", 3, 5, 3 - 5);
//
//}


//{//ex 2-5
//	printf("10진수 : %d는 16진수  :%x, 8진수 : %o 입니다.\n", 50 , 50 , 50);
//	printf("10진수 : %d는 16진수 : %x, 8진수 : %o 입니다.\n", -50, -50, -50);
//	// 진수와8진수는 음수표현불가
//
//}


//{//Ex 2-6
//	printf("10진수 정수 : %d \n", 0.5);
//	printf("10진수 실수 : %f \n", 0.5);
//	printf("10진수 실수 : %1f \n", 0.5);
//
//	printf("소수점 이하 6자리 이상 : %f \n", 0.5655678);
//	printf("소수점 이하 6 자리 이상 : %1f \n", 0.5667784);
//
//
//}


////Ex 2-7
//{
//	
//
//	printf(" a룰 대문자로 표현한다면  %c 입니다.\n", 'A');
//	printf(" %s %c 입니다. \n", "a를 대문자로 표현하면", 'A');
//	printf(" %s %d %s\n", "2 곱하기 3은", 2 * 3, "입니다.");
//
//}



//{     //Ex 2-8
//
//	printf("%d  \n", 2147483647);
//	printf("%d \n",  2147483650);
//	printf("%u \n", 4294967295);
//
//
//
//}

//{  //Ex 2-9
//	printf("%f \n", 0.000123);
//	printf("%f \n", 0.0001236);
//	
//	printf("%e \n", 0.000123);
//	printf("%E \n", 0.0001236);
//
//	printf("%g \n", 0.000123);
//	printf("%G \n", 0.000123456);
//
//	printf("올해 우리나라 경제 성장률은 5%%입니다.\n");
//
//}

//{//Ex2-10
//
//	printf (" %3d , %3d ,  %3d \n ", 1, 20, 300);
//	printf (" %-3d , %-3d ,%-3d \n", 1, 20, 300);
//	printf(" %+3d,  %+3d,  %+3d\n", 1, 20, 300);
//	printf("%+3d,  %+3d,  %+3d\n", 1, 20, -300);
//
//
//}

//#include <stdio.h>
//void main()
//{
//
//    printf(" %2c \n", '*');
//	printf("%3c %c3 %c3\n", '*', '*', '*');
//	printf("%4c %4c %4c\n", '*', '*', '*', '*');
//	printf("%3c %c3 %c3\n", '*', '*', '*');
//	printf(" %2c \n", '*');
//
//}
//
//{
//	printf(" %d * %d = %d\n" , 2, 1, 2 * 1);
//	printf(" %d * %d = %d\n", 2, 2, 2 * 2);
//	printf(" %d * %d = %d\n", 2, 3, 2 * 3);
//	printf(" %d * %d = %d\n", 2, 4, 2 * 4);
//	printf(" %d * %d = %d\n", 2, 5, 2 * 5);
//	printf(" %d * %d = %d\n", 2, 6, 2 * 6);
//	printf(" %d * %d = %d\n", 2, 7, 2 * 7);
//	printf(" %d * %d = %d\n", 2, 8, 2 * 8);
//	printf(" %d * %d = %d\n", 2, 9, 2 * 8 );

//}

#include <stdio.h>


void main()

printf(" 홍길동\n 홍 길 동\n 홍  길  동\n");
{

	printf("%16s \n", "최용석");
	printf("%18s \n", "경기도 수원시 권선구 탑동773-1");
	printf("%18s \n", "01057633179");


	printf("제 이름은 홍길동 입니다\n 제 나이는 %3d 이고요\n 제가 사는 곳 의 번지수는 %3d %2d 입니다.\n", 20, 123, -456);


	printf("%d * %d = %d \n", 4, 5, 20);
	printf("%d * %d = %d \n ", 7, 9, 63);

	 
}

